app/controllers/api/exports_controller.rb

  def create
    project = ResearchProject.find(params[:research_project_id])
---
SELECT "research_projects".* FROM "research_projects" WHERE "research_projects"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]