app/controllers/api/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "research_project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["research_project_id", 6], ["created_at", "2025-03-31 00:35:38.842428"], ["updated_at", "2025-03-31 00:35:38.842428"]]
---
  def create
    # Create a favorite associated with the current user
    favorite = current_user.favorites.build(research_project_id: params[:research_project_id])

    # Returns a JSON success response or validation errors
    # Remember using React for the frontend,
    # needs JSON data rather than rendered HTML
    if favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."research_project_id" = $2 LIMIT $3  [["user_id", 40], ["research_project_id", 21], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
---
  def destroy
    # Finds the specific favorite for this user and project
    favorite = current_user.favorites.find_by(research_project_id: params[:research_project_id])

    # It only calls destroy if favorite exists
    if favorite&.destroy