app/controllers/api/metrics_controller.rb

  def set_research_project
    @research_project = if current_user.admin?
                          ResearchProject.find(params[:research_project_id])
                        else
                          current_user.research_projects.find(params[:research_project_id])
---
SELECT "research_projects".* FROM "research_projects" WHERE "research_projects"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "research_projects".* FROM "research_projects" WHERE "research_projects"."user_id" = $1 AND "research_projects"."id" = $2 LIMIT $3  [["user_id", 41], ["id", 18], ["LIMIT", 1]]