app/controllers/api/notes_controller.rb

  def index
    metric = Metric.find(params[:metric_id])
---
SELECT "metrics".* FROM "metrics" WHERE "metrics"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]

  def create
    # Creates a note associated with the current user
    note = current_user.notes.build(note_params)

    # Returns a JSON success response or validation errors
    if note.save
---
INSERT INTO "notes" ("user_id", "metric_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 40], ["metric_id", 281], ["content", "new note test"], ["created_at", "2025-04-03 22:06:45.627297"], ["updated_at", "2025-04-03 22:06:45.627297"]]

  def destroy
    # Destroy a note
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 400]]

  def set_note
    # Finds a note that belongs to the current user
    @note = current_user.notes.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 40], ["id", 400], ["LIMIT", 1]]