app/controllers/api/research_projects_controller.rb

SELECT "research_projects".* FROM "research_projects"
---
  def index
    # For admins, show all projects
    # For researchers, show only their projects
    projects = if current_user.role == "admin"
                ResearchProject.all

SELECT "research_projects".* FROM "research_projects" WHERE "research_projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "research_projects".* FROM "research_projects" WHERE "research_projects"."user_id" = $1 AND "research_projects"."id" = $2 LIMIT $3  [["user_id", 41], ["id", 18], ["LIMIT", 1]]
---
  def set_research_project
    # Allow admins to access any project, but researchers only their own
    @research_project = if current_user.admin?
                          ResearchProject.find(params[:id])
                        else
                          current_user.research_projects.find(params[:id])